load-test/loadTestResult.txt
ab -p input.txt -T application/json -H "Content-Type: application/json" -c 3 -n 1000 http://localhost:9000/proxy/rest-cmd/
This is ApacheBench, Version 2.3 <$Revision: 1757674 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        akka-http/10.1.8
Server Hostname:        localhost
Server Port:            9000

Document Path:          /proxy/rest-cmd/
Document Length:        252 bytes

Concurrency Level:      3
Time taken for tests:   9.207 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      396000 bytes
Total body sent:        220000
HTML transferred:       252000 bytes
Requests per second:    108.62 [#/sec] (mean)
Time per request:       27.620 [ms] (mean)
Time per request:       9.207 [ms] (mean, across all concurrent requests)
Transfer rate:          42.00 [Kbytes/sec] received
                        23.34 kb/s sent
                        65.34 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.2      1       3
Processing:    17   27   7.0     27      93
Waiting:       17   26   7.0     26      91
Total:         18   27   7.1     27      94

Percentage of the requests served within a certain time (ms)
  50%     27
  66%     29
  75%     29
  80%     30
  90%     32
  95%     34
  98%     44
  99%     54
 100%     94 (longest request)